//=============================================================================
//
// バトル処理（プレイヤーもエネミーも呼び出す処理） [battle.cpp]
// Author : HAL東京 GP11B341-17 80277 染谷武志
//
//=============================================================================
#include "main.h"
#include "battle.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************

//=============================================================================
//攻撃が当たったときに発生する動き
//=============================================================================
void HitAction(CHARA *AttackChara, CHARA *DefendChara)
{
	switch (AttackChara->Animation->CurrentAnimID)
	{
	case Punchi:
		// 敵の状態確認
		// 敵のモーション変更
		// ダメージ
		DefendChara->HPzan -= DAMAGE_PUNCHI;
		// SPゲージ増減
		// エフェクト
		AttackChara->HitFrag = true;
		break;
	case Kick:
		break;
	case Shoryu:
		break;
	default:
		break;
	}
}