//=============================================================================
//
// ゲーム処理 [game.h]
// Author : HAL東京 GP11B341-17 80277 染谷武志
//
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_

#define HITSTOP_TIME	(7)		// ヒットストップをする時間

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);
bool GetHitStop(void);
void SetHitStop(void);

#endif