//=============================================================================
//
// 当たり判定処理 [HitCheck.h]
// Author : HAL東京 GP11B341-17 80277 染谷武志
//
//=============================================================================
#ifndef _HITCHECK_H_
#define _HITCHECK_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
bool hitBC(D3DXVECTOR3 AttackPos, D3DXVECTOR3 DefendPos, float AttackRange, float DefendRange);

#endif