//=============================================================================
//
// ポーズ画面処理 [pause.h]
// Author : HAL東京 GP11B341 17 染谷武志
//
//=============================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_PAUSE	_T("data/TEXTURE/pause000.png")		// ポーズ画面用画像
#define	PAUSE_POS_X		(0)									// ポーズ画面の表示位置
#define	PAUSE_POS_Y		(0)									// ポーズ画面の表示位置
#define	PAUSE_SIZE_X	(1280)								// ポーズ画面の幅
#define	PAUSE_SIZE_Y	(720)								// ポーズ画面の高さ


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPause(int type);
void UninitPause(void);
void UpdatePause(void);
void DrawPause(void);
HRESULT MakeVertexPause(void);

#endif
