//=============================================================================
//
// ポーズ画面処理 [pause.h]
// Author : HAL東京 GP11B341 17 染谷武志
//
//=============================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_PAUSE	_T("data/TEXTURE/pause000.png")		// 読み込むテクスチャファイル名
#define	PAUSE_POS_X		(0)								// タイトルロゴの表示位置
#define	PAUSE_POS_Y		(0)								// タイトルロゴの表示位置
#define	PAUSE_SIZE_X	(1280)							// タイトルロゴの幅
#define	PAUSE_SIZE_Y	(720)							// タイトルロゴの高さ


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPause(int type);
void UninitPause(void);
void UpdatePause(void);
void DrawPause(void);

#endif
