//=============================================================================
//
// リザルト画面処理 [result.h]
// Author : HAL東京 GP11B341 17 染谷武志
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_RESULT		_T("data/TEXTURE/result000.png")			// 読み込むテクスチャファイル名
#define	RESULT_POS_X			(0)										// リザルトの表示位置
#define	RESULT_POS_Y			(0)										// リザルトの表示位置
#define	RESULT_SIZE_X		(1280)										// リザルトの幅
#define	RESULT_SIZE_Y		(720)										// リザルトの高さ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResult(int type);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
