//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : HAL東京 GP11B341 17 染谷武志
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_TITLE_LOGO	_T("data/TEXTURE/logo000.png")		// 読み込むテクスチャファイル名
#define	TITLELOGO_POS_X		(0)								// タイトルロゴの表示位置
#define	TITLELOGO_POS_Y		(0)								// タイトルロゴの表示位置
#define	TITLELOGO_SIZE_X	(1280)							// タイトルロゴの幅
#define	TITLELOGO_SIZE_Y	(720)							// タイトルロゴの高さ


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(int type);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);
HRESULT MakeVertexTitle(void);

#endif
